app/controllers/member/foods_controller.rb

  def index
    @foods = @current_user.foods.all
---
SELECT * FROM `foods` WHERE (`foods`.user_id = 1)