app/controllers/member/homes_controller.rb

  def index
    @home = Home.new
    @recent_goal = @current_user.goals.last
    if @recent_goal.nil? then @recent_goal =  Goal.new end
    @goal = @recent_goal
    @fact = QuickFact.find(:first, :offset=>(rand(QuickFact.all.size - 1)) )
    if @fact.nil? then @fact = QuickFact.new end

    @quick_support = QuickSupport.new

    @week_water_sum = @current_user.waters.sum(:ounces, :conditions => ['date >= ?', Time.now - 7.days])

    @today_water_sum = @current_user.waters.sum(:ounces, :conditions => ['date >= ?', Time.now ])

    @week_calories_sum = @current_user.foods.sum(:calories, :conditions => ['date >= ?', Time.now - 7.days])
---
SELECT * FROM `goals` WHERE (`goals`.user_id = 1) ORDER BY goals.id DESC LIMIT 1
SELECT * FROM `waters` WHERE (`waters`.user_id = 1) ORDER BY date asc
SELECT sum(`waters`.ounces) AS sum_ounces FROM `waters` WHERE (date >= '2009-06-18 17:36:26') AND (`waters`.user_id = 1)
SELECT * FROM `foods` WHERE (`foods`.user_id = 1) ORDER BY date asc
SELECT sum(`foods`.calories) AS sum_calories FROM `foods` WHERE (date >= '2009-06-18 17:36:26') AND (`foods`.user_id = 1)

  def create
    #@home = Home.new(params[:home])
    success = false;
    #raise params.to_yaml
    commit = params[:commit]

    if commit == "Add food" then
      aFood = @current_user.foods.new(params[:food])
      aFood.date = Time.now
      success = aFood.save

    elsif commit == "Record"
      aWeight = @current_user.weights.new(params[:weight])
      aWeight.date = Time.now
      success = aWeight.save
      #raise aWeight.to_yaml
    elsif commit == "Drank" then
      aDrink = @current_user.waters.new(params[:water])
      aDrink.date = Time.now
      success = aDrink.save
---
INSERT INTO `weights` (`created_at`, `updated_at`, `weight`, `date`, `user_id`) VALUES('2009-06-27 14:38:45', '2009-06-27 14:38:45', 170, '2009-06-27 14:38:45', 1)
INSERT INTO `waters` (`created_at`, `ounces`, `updated_at`, `date`, `user_id`) VALUES('2009-06-27 15:04:41', 8, '2009-06-27 15:04:41', '2009-06-27 15:04:41', 1)


    elsif commit=="New Goal" then
      goal = @current_user.goals.new(params[:goal])
      success = goal.save
---
INSERT INTO `goals` (`created_at`, `chest`, `belly_upper`, `water`, `updated_at`, `weight`, `belly_lower`, `hips`, `thigh`, `steps_daily`, `daily_calories`, `date`, `user_id`, `arm`) VALUES('2009-06-25 21:37:23', 0, 0, 64, '2009-06-25 21:37:23', 0, 0, 0, 0, 3000, 1250, '2009-06-21 00:00:00', 2, 0)

  def update

    raise params.to_yaml

    #@home = Home.find(params[:id])

    respond_to do |format|
      if @home.update_attributes(params[:home])
---
UPDATE `homes` SET `updated_at` = '2009-06-27 17:28:00', `chart_type` = 'weight' WHERE `id` = 1