app/controllers/member/profiles_controller.rb

  def update

    @profile = @current_user.profile

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
UPDATE `users` SET `updated_at` = '2009-06-27 02:15:11', `last_request_at` = '2009-06-27 02:15:11' WHERE `id` = 1