app/controllers/member/profiles_controller.rb

  def show
    @profile = Profile.find(params[:id])
---
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1

  def edit
    @profile = Profile.find(params[:id])
---
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1
UPDATE `profiles` SET `phone` = '', `shipping_address` = '', `updated_at` = '2009-06-30 03:06:58', `alt_phone` = '', `billing_state` = '', `shipping_state` = '', `billing_zip` = '', `time_zone` = '', `shipping_city` = '', `billing_address` = '', `shipping_zip` = '', `referred_by` = 'Jame', `billing_city` = '' WHERE `id` = 1