app/controllers/homes_controller.rb

SELECT * FROM `goals` WHERE (`goals`.user_id = 1) ORDER BY goals.id DESC LIMIT 1
SELECT * FROM `goals` WHERE (`goals`.user_id = 22)
SELECT * FROM `homes` WHERE (`homes`.user_id = 1) LIMIT 1
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1
SELECT * FROM `waters` WHERE (`waters`.user_id = 1) ORDER BY date asc
SELECT * FROM `foods` WHERE (`foods`.user_id = 1) ORDER BY date asc
SELECT sum(`foods`.calories) AS sum_calories FROM `foods` WHERE (date >= '2009-06-22 21:49:17') AND (`foods`.user_id = 1)
---
  def show

    @profile = @current_user.profile


    #raise @current_user.inspect

    @home = @current_user.home
    @recent_goal = @current_user.goals.last
    if @recent_goal.nil? then @recent_goal =  Goal.new end
    @goal = @recent_goal
    @fact = QuickFact.find(:first, :offset=>(rand(QuickFact.all.size - 1)) )
    if @fact.nil? then
      @fact = QuickFact.new
      @fact.title = "Blank"
      @fact.category = "Test"
      @fact.summary = "Please submit interesting facts"
    end

    if @home.nil? then
      @chart_type = 'all'
    else
      @chart_type = @home.chart_type
    end

    @quick_support = QuickSupport.new

    @week_water_sum = @current_user.waters.sum(:ounces, :conditions => ['date >= ?', Time.now - 7.days])

    @today_water_sum = @current_user.waters.sum(:ounces, :conditions => ['date >= ?', Time.now ])

    @week_calories_sum = @current_user.foods.sum(:calories, :conditions => ['date >= ?', Time.now - 7.days])

INSERT INTO `foods` (`name`, `created_at`, `updated_at`, `protein`, `date`, `user_id`, `calories`) VALUES('Herbal Tea Concentrate', '2009-06-30 02:40:39', '2009-06-30 02:40:39', NULL, '2009-06-30 02:40:39', 1, 5)
INSERT INTO `weights` (`created_at`, `updated_at`, `weight`, `date`, `user_id`) VALUES('2009-06-30 18:14:27', '2009-06-30 18:14:27', 112, '2009-06-30 18:14:27', 1)
INSERT INTO `waters` (`created_at`, `ounces`, `updated_at`, `date`, `user_id`) VALUES('2009-06-30 03:47:03', -4, '2009-06-30 03:47:03', '2009-06-30 03:47:03', 1)
---
  def create
    #@home = Home.new(params[:home])
    success = false;
    #raise params.to_yaml
    commit = params[:commit]

    if commit == "Add food" then
      aFood = @current_user.foods.new(params[:food])
      aFood.date = Time.now
      success = aFood.save

    elsif commit == "Record"
      aWeight = @current_user.weights.new(params[:weight])
      aWeight.date = Time.now
      success = aWeight.save
      #raise aWeight.to_yaml
    elsif commit == "Drank" then
      aDrink = @current_user.waters.new(params[:water])
      aDrink.date = Time.now
      success = aDrink.save

INSERT INTO `exercises` (`created_at`, `title`, `updated_at`, `date`, `user_id`, `length`, `calories`) VALUES('2009-06-30 03:47:27', 'Alcohol slows metabolism', '2009-06-30 03:47:27', '2009-06-30 03:47:27', 1, 1, -80)
---
      aExercise.calories = 80
      aExercise.length = 1
      aExercise.date = Time.now
      success = aExercise.save

INSERT INTO `measurements` (`created_at`, `chest`, `belly_upper`, `updated_at`, `belly_lower`, `hips`, `thigh`, `date`, `user_id`, `arm`) VALUES('2009-06-30 17:43:38', 30, 30, '2009-06-30 17:43:38', 30, 20, 20, '2009-06-30 17:43:38', 1, 14)
---
    elsif commit == "Measurements" then
      aMeasure = @current_user.measurements.new(params[:measurement])
      aMeasure.date = Time.now
      success = aMeasure.save

INSERT INTO `goals` (`created_at`, `chest`, `belly_upper`, `water`, `updated_at`, `weight`, `belly_lower`, `hips`, `thigh`, `steps_daily`, `daily_calories`, `date`, `user_id`, `arm`) VALUES('2009-07-27 23:28:37', 0, 0, 64, '2009-07-27 23:28:37', 120, 0, 0, 0, 3000, 1250, '2009-06-28 00:00:00', 1, 0)
INSERT INTO `quick_supports` (`created_at`, `title`, `details`, `updated_at`, `priority`, `user_id`, `status`) VALUES('2009-06-30 02:51:34', 'test', 'test msg details', '2009-06-30 02:51:34', 0, 1, NULL)
---

    elsif commit=="New Goal" then
      goal = @current_user.goals.new(params[:goal])
      success = goal.save

    elsif commit=="Support" then
      support = @current_user.quick_supports.new(params[:quick_support])
      success = support.save

UPDATE `homes` SET `updated_at` = '2009-06-30 02:40:33', `chart_type` = 'weight' WHERE `id` = 1
UPDATE `users` SET `updated_at` = '2009-06-30 01:55:49', `last_request_at` = '2009-06-30 01:55:49' WHERE `id` = 1
---

    elsif commit=="All Charts" then
      @current_user.home.chart_type = 'all'
      success =  @current_user.home.save