app/controllers/profiles_controller.rb

  def update

    @profile = @current_user.profile

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
UPDATE `profiles` SET `updated_at` = '2009-06-30 03:23:51', `time_zone` = 'a1' WHERE `id` = 1
UPDATE `users` SET `updated_at` = '2009-06-30 03:12:14', `last_request_at` = '2009-06-30 03:12:14' WHERE `id` = 1