app/controllers/testimonies_controller.rb

SELECT * FROM `testimonies`
---
  def index
    @testimonies = Testimony.all

SELECT * FROM `testimonies` WHERE (`testimonies`.`id` = 1)
---
  def show
    @testimony = Testimony.find(params[:id])

SELECT * FROM `testimonies` WHERE (`testimonies`.`id` = 1)
---
  def edit
    @testimony = Testimony.find(params[:id])

INSERT INTO `testimonies` (`photo`, `name`, `comment`, `votes`, `display_value`, `layout`, `created_at`, `public`, `title`, `updated_at`, `after`, `points`, `approved`, `before`) VALUES('donna_hollar.jpg', 'Donna Kollar', 'Donna lost 95 pounds.', 0, NULL, 'bottom', '2009-07-16 04:03:11', 1, 'Weight Loss Success', '2009-07-16 04:03:11', 125, 0, 1, 220)
---
  def create
    @testimony = Testimony.new(params[:testimony])

    respond_to do |format|
      if @testimony.save

SELECT * FROM `testimonies` WHERE (`testimonies`.`id` = 1)
UPDATE `testimonies` SET `updated_at` = '2009-07-16 04:28:20', `photo` = 'donna_kollar.jpg' WHERE `id` = 1
---
  def update
    @testimony = Testimony.find(params[:id])

    respond_to do |format|
      if @testimony.update_attributes(params[:testimony])