app/controllers/users_controller.rb

  def create
    #Logout first if there is a previous session open.
    if @user_session then @user_session.destroy end

    @user = User.new(params[:user])
    @profile = Profile.new(params[:profile])



    if (!(@profile.hight_feet.nil? && @profile.hight_inches.nil? )  && !@profile.dob.nil?) then
      success = @user.save
      flash[:notice] = "Please make sure you enter your hight and Date of Birth."
    else
      success = false
    end

    if (success) then
      success = @profile.save
      @user.profile = @profile
      @user.profile.save



      @home = Home.new
      @home.chart_type = 'all'
      @user.home = @home
      @user.home.save
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `admin`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2009-06-27 00:24:22', '2009-06-27 00:24:22', 'e7b666e45778ace57ff39c2cee6006a7467e217af620d3e5fc72f678850e919600477e53cc467a8008689abb2f1a0150ad9611df2b1f9dcbd99c30a84d7c7d30', '2009-06-27 00:24:22', NULL, 0, '127.0.0.1', '6LZS4UAsBxyHO6WAFbjm', '2009-06-27 00:24:22', '32a966faddb3757c3577d99c9abd75b4a847ddbc48fd1ba48ec05eeb1106faa57a82cab99f9468224843c7db7e75f3dce7d9801831bab0875aa16288a9a67216', 1, NULL, 'test1', NULL, 'test1@test.com')
INSERT INTO `profiles` (`shipping_state`, `referred_by`, `name_last`, `sufix`, `dob`, `created_at`, `updated_at`, `billing_city`, `billing_state`, `shipping_address`, `shipping_zip`, `hight_feet`, `user_id`, `sponsor`, `coach`, `alt_phone`, `billing_address`, `billing_zip`, `phone`, `hight_inches`, `nick_name`, `shipping_city`, `time_zone`, `name_first`, `middle_initial`) VALUES(NULL, 'Jo smith', 'Cutting', 'Jr', '1988-06-12', '2009-06-27 02:14:36', '2009-06-27 02:14:36', NULL, NULL, NULL, NULL, 5, NULL, '2077754130', NULL, NULL, NULL, NULL, NULL, 8, NULL, NULL, NULL, 'Philip', 'J')
INSERT INTO `homes` (`option`, `created_at`, `updated_at`, `time_span_days`, `chart_type`, `user_id`) VALUES(NULL, '2009-07-01 17:58:48', '2009-07-01 17:58:48', NULL, 'all', 2)



      aWeight = @user.weights.new(params[:weight])
      success = aWeight.save
---
INSERT INTO `weights` (`created_at`, `updated_at`, `weight`, `date`, `user_id`) VALUES('2009-07-28 01:07:47', '2009-07-28 01:07:47', 210, NULL, 7)



      goal = @user.goals.new(params[:goal])
      success = goal.save
---
INSERT INTO `goals` (`created_at`, `chest`, `belly_upper`, `water`, `updated_at`, `weight`, `belly_lower`, `hips`, `thigh`, `steps_daily`, `daily_calories`, `date`, `user_id`, `arm`) VALUES('2009-07-28 01:07:47', 0, 0, 105, '2009-07-28 01:07:47', 200, 0, 0, 0, 3000, 2200, '2009-06-28 00:00:00', 7, 0)

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2009-06-30 03:25:52', `crypted_password` = '6aa096b851379da22ff3712118986a4bd951518942f283e2c14511af66278aeab2cfb829341309d7ccb830e76a4f1ed255f0b86d0473bc125475f1f54c1019ad', `last_login_at` = '2009-06-30 03:08:34', `current_login_at` = '2009-06-30 03:25:52', `password_salt` = 'lJ7rNr1eIeHmDty45YrZ', `login_count` = 16, `persistence_token` = 'f2f8c7f346905e15574f9c61559284f964302a01c13709212945aac8246bbf28e4b57d8a3c39a29c608d261dbc4515de01bbaa8ca4b6daf8bc11310b29029fd5', `last_request_at` = '2009-06-30 03:25:52' WHERE `id` = 1